cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"

# Core Utilities
brew "mas"
brew "python"
brew "azure-cli"
brew "fish"
brew "jq"
brew "gh"
brew "kubernetes-cli"
brew "awscli"
brew "1password-cli"
brew "node@16", link: true
brew "openjdk", link: true
brew "wget"

# Quality of life utilities
brew "asdf"
brew "k9s"
brew "kubectx"
brew "trash"
brew "tree"
brew "stow"

# UI Apps
cask "1password"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "monitorcontrol"
cask "postman"
cask "visual-studio-code"
cask "wireshark"
cask "aerial"

mas "Microsoft Remote Desktop", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Steam Link", id: 1246969117
mas "1Password for Safari", id: 1569813296
mas "MQTT Explorer", id: 1455214828
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Tailscale", id: 1475387142
mas "Strongbox", id: 1270075435