cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"

brew "asdf"
brew "awscli"
brew "azure-cli"
brew "fish"
brew "gh"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "mas"
brew "node@16", link: true
brew "openjdk", link: true
brew "python"
brew "stow"
brew "trash"
brew "tree"
brew "wget"

cask "0-ad"
cask "1password-cli"
cask "1password"
cask "aerial"
cask "affinity-photo"
cask "docker"
cask "drawio"
cask "google-chrome"
cask "intune-company-portal"
cask "monitorcontrol"
cask "postman"
cask "soulver"
cask "visual-studio-code"
cask "wireshark"

mas "1Password for Safari", id: 1569813296
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft Powerpoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Strongbox", id: 1270075435
mas "Adobe Lightroom", id: 1451544217
